{
  "id": 1,
  "title": "hotelrez",
  "description": "This application allows users to easily search for hotels, make reservations, and view facility rules. It was developed as a graduation project for the Siliconmade Academy Mobile Frontend training program.",
  "features": [
    "Search for hotels and view detailed information.",
    "Hotel search based on dates, number of people, and number of rooms.",
    "View hotel details.",
    "Personalized favorite hotels and reservation management pages for the user.",
    "User-friendly and stylish design."
  ],
  "screens": [
    "assets/screenshots/hotel-rez/1.jpg",
    "assets/screenshots/hotel-rez/2.jpg",
    "assets/screenshots/hotel-rez/3.jpg",
    "assets/screenshots/hotel-rez/4.jpg",
    "assets/screenshots/hotel-rez/5.jpg",
    "assets/screenshots/hotel-rez/6.jpg",
    "assets/screenshots/hotel-rez/7.jpg",
    "assets/screenshots/hotel-rez/8.jpg",
    "assets/screenshots/hotel-rez/9.jpg",
    "assets/screenshots/hotel-rez/10.jpg",
    "assets/screenshots/hotel-rez/11.jpg",
    "assets/screenshots/hotel-rez/12.jpg",
    "assets/screenshots/hotel-rez/13.jpg",
    "assets/screenshots/hotel-rez/14.jpg",
    "assets/screenshots/hotel-rez/15.jpg",
    "assets/screenshots/hotel-rez/16.jpg",
    "assets/screenshots/hotel-rez/17.jpg",
    "assets/screenshots/hotel-rez/18.jpg",
    "assets/screenshots/hotel-rez/19.jpg",
    "assets/screenshots/hotel-rez/20.jpg",
    "assets/screenshots/hotel-rez/21.jpg",
    "assets/screenshots/hotel-rez/22.jpg"
  ],
  "screenTexts": {
    "HomePage": [
      "On the homepage, there is a search bar along with cards for recommended hotels and city cards.",
      "Users can search for hotels based on city, date, and number of people. The 'Your Destination' input field activates a modal where autocomplete is enabled. As text is entered, hotels and cities starting with the entered letters are filtered.",
      "When the check-in and check-out dates are clicked, a modal for date selection opens, allowing both dates to be selected via DateTimePicker.",
      "This screen is the modal screen in the hotel reservation application where room and guest selections are made. Users can specify the number of rooms, adults, and children, and also enable the pet-friendly option. After completing their selections, they can confirm the process by clicking the Apply button."
    ],
    "SearchResults": [
      "This screen displays the list of hotel search results. Users can view hotels suitable for the selected city and date range. Each hotel’s name, price, rating, and image are displayed. The heart icon in the top right can be used to add hotels to favorites. Clicking on the header opens a modal similar to the search bar on the homepage, where search criteria can be adjusted."
    ],
    "HotelDetails": [
      "This screen displays detailed information about the selected hotel. Users can view the hotel’s name, rating, price, and images. The hotel’s facilities, rules, and location are also displayed. Users can view the hotel’s rooms and make reservations."
    ]
  }
}
